Terraform plan in __terraform__
<details>
  <summary>Plan: 1 to add, 2 to change, 1 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloudfunctions_function.gmail_notifier_oauth2init_function will be updated in-place
  ~ resource "google_cloudfunctions_function" "gmail_notifier_oauth2init_function" {
        id                    = "projects/lilaobot/locations/europe-west1/functions/oauth2init"
        name                  = "oauth2init"
      ~ source_archive_object = "gmail_notifier.zip" -> "gmail_notifier.zip#040649a3d829d49bb5e35b454f36c531"
        # (14 unchanged attributes hidden)
    }

  # google_cloudfunctions_function.slack_publisher_function will be updated in-place
  ~ resource "google_cloudfunctions_function" "slack_publisher_function" {
        id                    = "projects/lilaobot/locations/europe-west1/functions/slack-publisher"
        name                  = "slack-publisher"
      ~ source_archive_object = "slack_publisher.zip" -> "slack_publisher.zip#4fbd529289d366c584be6729c6d80e09"
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_storage_bucket_object.gmail_notifier_archive_bucket_object must be replaced
-/+ resource "google_storage_bucket_object" "gmail_notifier_archive_bucket_object" {
      ~ content_type   = "application/zip" -> (known after apply)
      ~ crc32c         = "Q+BjlA==" -> (known after apply)
      ~ detect_md5hash = "wNl06pxvq8UAOLSXdzksoQ==" -> "different hash" # forces replacement
      ~ id             = "******************************************************************************" -> (known after apply)
      ~ md5hash        = "wNl06pxvq8UAOLSXdzksoQ==" -> (known after apply)
      ~ name           = "gmail_notifier.zip#c0d974ea9c6fabc50038b49777392ca1" -> "gmail_notifier.zip#040649a3d829d49bb5e35b454f36c531" # forces replacement
      ~ output_name    = "gmail_notifier.zip#c0d974ea9c6fabc50038b49777392ca1" -> (known after apply)
      ~ self_link      = "https://www.googleapis.com/storage/v1/b/lilaobot-functions-storage/o/gmail_notifier.zip%23c0d974ea9c6fabc50038b49777392ca1" -> (known after apply)
      ~ storage_class  = "STANDARD" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```
</details>

Plan generated in [Create terraform plan #30](https://github.com/Zenika/lilaobot/actions/runs/1096870914)